<template>
	<div>
		<Head></Head>
		<!-- <div style="border: 20px solid red;"></div> -->
		<div style="position: relative; height: 1000px; padding-top:10px; width: 88%; margin: 0 auto; background-color: #FFFFFF; margin-top: 30px;">
			<el-steps :active="num" finish-status="success" simple>
				<el-step title="机构入驻协议"></el-step>
				<el-step title="公益事业"></el-step>
				<el-step title="提交认证"></el-step>
			</el-steps>
			<div class="box1" v-if="stepvalue==1">
				<div class="read">1.重要须知
					1.1.本协议是用户与北京三快云计算有限公司（以下简称“美团公益”）之间关于美团公益平台（以下简称“公益平台”）服务产品的法律协议。美团公益平台指域名为：https://gongyi.meituan.com/的平台，包括但不限于美团公益网、美团公益网移动版、美团公益微信小程序。美团公益通过互联网为具有公开募捐资格的慈善组织发布公开募捐信息提供网络服务，为慈善组织、捐赠人、社会公众等主体提供相关信息服务，美团公益平台上的用户可通过公益平台参与公益活动，相关公益活动的信息真实性由活动发起者负责。
					1.2.美团公益在此特别提醒用户认真阅读本协议中的各个条款，并特别提醒用户欲使用公益平台服务，必须事先认真阅读本服务条款中各条款，包括免除或者限制美团公益责任的免责条款及对用户的权利限制条款。
					1.3.本协议条款可由美团公益随时更新，且毋须另行通知。本协议条款一旦发生变更，美团公益将在网页上公布修改内容。修改后的协议条款一旦在网页上公布即有效，并代替原来的协议条款。用户有义务登陆网站查阅最新版服务条款。
					1.4.用户阅读后，请选择接受或不接受本服务条款（未成年人审阅时应得到法定监护人的陪同）。
					1.5.如用户不同意本服务条款或不同意美团公益对服务条款的修改，则用户无权使用并应主动取消美团公益提供的服务。
					1.6.用户的使用行为将被视为用户对全部服务条款的完全接受，包括接受美团公益对服务条款随时所做的任何修改，并同意接受本协议各项条款的约束。
					1.7.用户若有违反本协议规定，美团公益有权终止用户美团公益平台服务的使用资格并保留追究相关法律责任的权利。
					1.8.美团公益作为平台，不接受用户捐款。用户捐款资金直接进入慈善组织的银行账户或授权的第三方支付账户，美团公益平台不截留或代收捐赠资金，亦不向任何一方收取服务费。用户在支付前视为已经知悉捐款去向，捐款无法从平台上退回。如用户主张捐赠金额有误，需与发布募捐信息、接受捐款的有公开募捐资格的慈善组织协商解决，与美团公益平台无关。
					2.公益平台保护条款
					美团公益平台是由美团公益版权所有。公益平台展示的自有内容（包括但不限于名称、程序编码、主题、声音效果、视觉效果等）的著作权、专利权、商标、商业秘密及其它任何所有权或权利，均属美团公益所有。非经美团公益的同意，用户不得为了任何目的而擅自下载、修改、编辑、使用公益平台相关内容，否则应依法承担相应的法律责任。
					3.用户的基本义务
					3.1.用户应当遵守中华人民共和国法律，不得利用本公益平台进行（从事）危害国家安全、泄露国家秘密的行为，不得侵犯国家、社会、集体的和公民的合法权益，不得利用本公益平台制作、复制和传播下列信息：
					（一）煽动抗拒、破坏宪法和法律、行政法规实施的；
					（二）煽动颠覆国家政权，推翻社会主义制度的；
					（三）煽动分裂国家、破坏国家统一的；
					（四）煽动民族仇恨、民族歧视，破坏民族团结的；
					（五）捏造或者歪曲事实，散布谣言，扰乱社会秩序的；
					（六）宣扬封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的；
					（七）公然侮辱他人或者捏造事实诽谤他人的，或者进行其他恶意攻击的；
					（八）损害国家机关信誉的；
					（九）其他违反宪法和法律行政法规的。
					3.2.用户在遵守法律及本协议的前提下可依本协议使用公益平台服务，用户无权实施包括但不限于下列行为：
					3.2.1.删除公益平台及其他副本上所有关于版权的信息、内容；
					3.2.2.对于公益平台上相关信息等，未经美团公益书面同意使用、复制、修改、链接、转载、汇编、发表、出版公益平台相关内容、建立镜像站点、擅自借助公益平台发展与之有关的衍生产品、作品等；
					3.2.3.利用公益平台侵害他人合法权益的行为，包括但不限于发表、传送、传播、储存侵害他人知识产权、商业机密等合法权利的内容等；
					3.2.4.进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐户；未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；未经许可，企图探查、扫描、测试本公益平台网站系统或网络的弱点或其它实施破坏网络安全的行为；企图干涉、破坏公益平台系统或网站的正常运行，故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称等。
					3.3.用户如果需要使用公益平台服务，必须满足以下条件：
					3.3.1.用户需拥有或有权使用登陆网站的终端设备；
					3.3.2.能够连接上互联网，并自行负担上网所需的各项费用；除了在本协议内所提及的款项之外，用户必须自行负担全部所需的硬件费用、软件费用、网络服务费用以及相关的税收。
					4.用户须知
					4.1.用户完成公益平台注册程序并自行设置密码后，将获得公益平台使用帐号，用户应自行承担帐号及帐号密码的安全保护责任。用户对其帐号下（包括但不限于美团点评帐号，美团点评帐号下的捆绑手机号码、邮箱等）所进行的任何活动负完全的责任，美团公益无法对非法或未经用户授权使用用户帐号及密码的行为作出甄别，因此美团公益不承担任何责任。在此，用户同意并承诺做到：
					1）当用户的密码或帐号遭到未获授权的使用，或者发生其他任何安全问题时，用户会立即有效通知到美团公益；
					2）且当用户每次上网或使用其他服务完毕后，会将有关帐号等安全退出。
					4.2.用户同意于注册时提供完整、详尽、真实的个人资料或法人注册资料，若所提供的资料于日后有变更的，用户应当及时在公益平台中进行更新。若用户所提供的资料与事实不符或所提供的资料业已变更而未更新或有任何误导之嫌疑，导致公益平台无法提供服务的，美团公益及公益平台不因此承担任何责任。
					4.3.公益平台产品同大多数因特网产品一样，易受到各种安全问题的困扰，此类包括但不限于：
					4.3.1.用户透露详细个人资料，被不法分子利用，造成现实生活中的骚扰；
					4.3.2.用户被哄骗、被破译密码；
					4.3.3.用户下载安装的其它软件中含有“特洛伊木马”等病毒，威胁到个人计算机上信息和数据的安全，继而威胁对公益平台的使用。用户须明白并自行承担以上风险，美团公益及公益平台对此不承担任何责任。
					4.4.通过任何非经美团公益或美团公益授权开发并正式发布的其它网页或软件访问公益平台，将可能导致不可预知的风险，由此产生的一切法律责任与纠纷一概与美团公益及公益平台无关。用户不得轻易访问此类网页或下载、安装、使用此类软件，否则，美团公益及公益平台有权采取惩罚性措施，包括但不限于中/终止用户公益平台帐号使用资格、中/终止用户公益平台使用资格。
					4.5.美团公益在此郑重提请用户注意，任何经由公益平台服务上传、下载、张贴、发送的即时信息、电子邮件或任何其他方式传送的资讯、资料、文字、软件、音乐、音讯、照片、图形、视讯、信息、用户的登记资料或其他资料等（以下简称“内容”），无论系公开还是私下传送，均由内容提供者承担责任。美团公益无法完全监控经由公益平台服务传送之内容，也无法对用户的使用行为进行全面控制，因此不保证内容的合法性、正确性、完整性、真实性或品质等；用户已预知使用本服务时，可能会接触到令人不快、不适当或令人厌恶之内容，并同意将自行加以判断并承担所有风险，而不依赖于美团公益或公益平台。但在任何情况下，美团公益有权依法停止任何前述内容的服务并采取相应行动，包括但不限于暂停用户使用本服务的全部或部分，保存有关记录，并向有关机关报告。但美团公益及公益平台有权（但无义务）依其自行之考量，拒绝和删除可经由本服务提供之违反本条款的或其他引起美团或其他用户反感的任何内容。
					4.6.个人用户须知
					4.6.1.个人用户是指：
					4.6.1.1.年满十八周岁，并具有民事权利能力和民事行为能力的自然人；
					4.6.1.2.未满十八周岁，但监护人（包括但不仅限于父母）同意的自然人；
					4.6.1.3.无民事行为能力人、限制民事行为能力人不当注册为公益平台用户或超过其民事权利或行为能力范围从事公益的，其与美团公益之间的服务条款自始无效，美团公益一经发现，有权立即注销该帐号，并追究其使用公益平台“服务”的一切法律责任。
					4.6.2.个人用户可以在公益平台注册使用帐号，可以凭自己的判断参与有公开募捐资格的慈善组织通过公益平台发布的公开募捐活动；个人用户在注册时应提供真实的资料，包括但不限于姓名、身份证、实名网络验证、银行卡验证等，并保证如联系电话、联系地址等内容的有效性及准确性，同时有义务在相关资料发生变化时及时更新有关注册资料。如果个人用户提供的资料或信息包含有无效、不正确、不真实的信息，美团公益平台保留取消
					为该用户提供服务的权利。
					4.6.3.个人用户通过公益平台参与活动，所发生的一切纠纷及损失与美团公益及公益平台无关，美团公益或公益平台不会对相关的纠纷或损失承担任何责任。个人用户参与活动时应当多方面主动了解活动组织者或组织单位的资质及信用信息，自行鉴别信息的真伪，并为自己的行为负责。
					4.6.4.个人用户有权利知道组织活动责任方及活动的信息。个人用户有权利从组织活动责任方处得知自己的捐款去向。
					4.6.5.个人用户在公益平台上参与活动过程中与组织方发生纠纷，可以请求公益平台从中予以协调。个人用户若发现其他用户或组织方有违法或违反本协议的行为，可以向公益平台进行反映要求处理。但美团公益及公益平台并不对处理结果做任何保证或承诺。
					4.6.6.个人用户参与活动的过程中应遵循诚实信用的原则、遵守社会公德及公序良俗原则，不得扰乱活动的正常进行，不进行与活动无关的行为或进行其他任何违法行为。
					4.6.7.个人用户不得在公益平台上恶意评价任何组织方和其他用户，或采取不正当手段提高自身的信用度或降低任何组织方和其他用户的信用度。
					4.6.8.个人用户不得在公益平台上发布各类违法或违规信息。
					4.6.9.个人用户使用公益平台时实施的所有行为均应遵守国家法律、法规和公益平台的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，个人用户将以自己的名义独立承担所有相应的法律责任。
					4.6.10.个人用户不得对公益平台上任何信息做商业性利用，包括但不限于在未经公益平台事先书面批准的情况下，以复制、传播等方式使用在公益平台上展示的任何资料。
					4.7.组织用户须知
					4.7.1.本协议中的“组织用户”是指：
					4.7.1.1.根据中国法律或设立地法律、法规和/或规章成立并合法存在的自愿参与慈善活动的慈善组织、基金会、社会服务机构、社会团体、公司、企事业单位、和其他组织（下称“组织用户”）；
					4.7.1.2.无经营或特定经营资格的组织不当注册为公益平台用户或超过其民事权利或行为能力范围从事公益的，其与美团公益之间的服务条款自始无效，美团公益一经发现，有权立即注销该组织的帐号，并追究其使用公益平台“服务”的一切法律责任。除具有公募资格的慈善组织之外，其他用户不得在公益平台上发布募捐活动。
					4.7.2.“组织用户”中的有公募资格的慈善组织特别要求条款：
					4.7.2.1.有责任保证在公益平台上发布的案例均为真实，并且所募金额必须在合理范围之内；
					4.7.2.2.有义务向公益平台上传相应的公募备案资料以及其与合作机构的合作协议等证明文件；
					4.7.2.3.有责任通过发布公告公示或其他途径告知捐款人款项的使用详情；
					4.7.2.4.在捐款金额中，收取项目管理费用的，应当通过在公益平台公示的方式告知捐款人，并且应当按照国家相关法律法规的规定收取。
					4.7.2.5.有义务向捐赠人出具符合法律规定的捐赠收据。若相关捐赠系通过美团（包括但不限于美团外卖、美团酒店等）组织开展，则美团有权代捐赠人向该等组织用户申请捐赠收据，该等组织用户应当配合。
					4.7.3.组织用户可以在公益平台注册使用帐号；组织用户在注册时应提供组织的真实资料，并保证如联系电话、联系地址等内容的有效性及准确性，同时在相关资料发生变化时及时更新有关注册资料，以便活动能够顺利进行。如果组织用户提供的资料或信息包含有无效、不正确、不真实的信息，美团公益平台保留取消组织用户发布资格并随时终止为该用户提供服务的权利。
					4.7.4.仅具有公募资格的慈善组织用户可以在公益平台发布合法的公益活动。
					4.7.5.发布募捐信息的具有公募资格的慈善组织用户可以查询参与活动的个人用户的信息，但美团公益及公益平台并不保证信息的真实性，组织用户应通过其他有效途径进行验证。
					4.7.6.组织用户在公益平台上组织活动过程中与其他用户发生纠纷，可以请求公益平台从中予以协调；组织用户若发现其他组织方或用户有违法违规或违反本协议的行为，可以向公益平台进行反映要求处理；但美团公益及公益平台并不对处理结果做任何保证或承诺。
					4.7.7.组织用户在组织或参与活动的过程中应遵循诚实信用的原则，遵守社会公德及公序良俗原则，不得随意变更或取消活动，如有特殊情况需要变更活动应有效通知用户并协商进行，不得利用活动进行任何侵害他人或违法的行为。
					4.7.8.组织用户不得在公益平台上恶意评价其他组织方和用户，或采取不正当手段提高自身的信用度或降低其他组织方和用户的信用度。
					4.7.9.组织用户不得在公益平台上发布各类违法或违规信息。
					4.7.10.组织用户使用公益平台时实施的所有行为均应遵守国家法律、法规和公益平台的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，组织用户将以自己的名义独立承担所有相应的法律责任。
					4.7.11.组织用户不得对公益平台上任何信息做商业性利用，包括但不限于在未经公益平台事先书面批准的情况下，以复制、传播等方式使用在公益平台上展示的任何资料。
					5.公益平台服务声明及免责事由
					5.1.用户使用公益平台由用户自己承担风险，在适用法律允许的最大范围内，美团公益在任何情况下不就因使用或不能使用本产品所发生的特殊的、意外的、非直接或间接的损失承担赔偿责任。即使已事先被告知该损害发生的可能性。美团公益及公益平台在此特别提醒用户：目前美团公益平台仅接受有公开募捐资格的慈善组织用户发布、组织募捐活动，不接受个人发布求助或募捐信息，用户应当谨慎识别募捐活动发布方的资质及信息真实性。
					5.2.用户须明白，使用公益平台服务产品涉及到互联网服务，可能会受到各个环节不稳定因素的影响。因此服务存在不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险。用户须承担以上风险，美团公益及公益平台不作任何担保。对因此导致用户不能发送和接受阅读消息、或接发错消息，美团公益及公益平台不承担任何责任。
					5.3.如公益平台的系统发生故障影响到本服务的正常运行，美团公益承诺在第一时间内与相关单位配合，及时处理进行修复。但用户因此而产生的经济损失，美团公益、公益平台及合作单位不承担责任。此外，美团公益及公益平台保留不经事先通知为维修保养、升级或其他目的暂停本服务任何部分的权利。
					5.4.用户须明白，在使用本服务产品存在有来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）的匿名或冒名的信息的风险，用户须承担以上风险，美团公益、公益平台及合作单位对服务不作任何类型的担保，不论是明确的或隐含的，包括所有有关信息真实性、适商性、适于某一特定用途、所有权和非侵权性的默示担保和条件，对因此导致任何因用户不正当或非法使用服务产生的直接、间接、偶然、特殊及后续的损害，不承担任何责任。
					5.5.本协议定义的信息内容包括但不限于：文字、软件、声音、相片、录像、图表；在广告中全部内容；公益平台为用户提供的信息受版权、商标权、和其它知识产权和所有权法律的保护等。所以，用户只能在公益平台及相关权利人的授权下才能使用这些内容，而不能擅自复制、修改、编撰这些内容、或创造与内容有关的衍生产品。因用户擅自复制、修改、编撰等行为导致的任何形式的责任及索赔均由用户自行承担相应的责任。
					5.6.使用本服务必须遵守国家有关法律和政策等，维护国家利益，保护国家安全，并遵守本条款，对于用户违法或违反本条款的使用(包括但不限于言论发表、传送等)而引起的一切责任，由用户负全部责任，概与美团公益、公益平台及合作单位无关，导致美团公益、公益平台及合作单位损失的，美团公益、公益平台及合作单位有权要求赔偿，并有权立即停止向其提供服务，保留相关记录，并保留配合司法机关追究用户法律责任的权利。
					5.7.尊重用户隐私是美团公益的一贯制度，美团公益将会采取合理的措施保护用户的资料信息，除法律或政府要求或用户同意等原因外，美团公益未经用户同意不向除合作单位以外的第三方公开、透露用户信息。但是用户在注册时选择或同意公开，或用户与美团公益及合作单位之间就用户资料公开或使用另有约定的除外，同时用户应自行承担因此可能产生的任何风险，美团公益对此不予负责。用户在此同意美团公益通过电子邮件或短信或微信方式向其发送包括用户信息和服务信息在内的相关商业及非商业联络信息，而不视上述邮件为垃圾邮件或垃圾短信。
					5.8.用户对自己的各类财产帐户、银行卡、信用卡及对应密码等重要资料信息负有保管责任，请用户注意勿在使用公益平台上透露自己的各类财产帐户、银行卡、信用卡及对应密码等重要资料，否则由此带来的任何损失由用户自行承担。
					5.9.公益平台属于群体类平台产品，参与公益平台上活动的个人之间，或个人与发起活动各个组织之间，或组织与组织之间引发的任何纠纷美团公益将不负责任。
					5.10.由于第三方人为或非人为因素例如网络中断等，导致公益平台的部分或全部用户无法正常使用其功能的，美团公益及公益平台将不予补偿由此带来的经济损失。
					5.11.用户应规范、合法地使用公益平台，如用户有在公共环境下捣乱、骚扰、欺骗其他用户等行为或者实施其他违反本协议的行为，一经发现，美团公益及公益平台有权停止其在公益平台的任何活动及终止其使用帐号等。
					5.12.用户不得利用公益平台进行违反国家法律的活动。如有发现，美团公益会配合公安部门全力协助调查工作。
					6.其他约定
					6.1.美团公益及公益平台保留随时地、不事先通知地、不需要任何理由地、单方面地修订本协议的权利。本协议一经修订，美团公益将会用修订后的协议版本完全替代修订前的协议版本，并通过原有方式向所有用户公布。用户应当及时关注和了解本协议的修订情况，如果用户不同意修订后协议版本，请用户立即停止对公益平台实施任何使用行为，否则即视同用户同意并完全接受修订后的协议版本。
					6.2.美团公益将本协议内置于公益平台用户注册页面当中，用户在注册的过程中即可查阅、了解本协议，亦可以通过点击“我同意”或“我接受”表示用户完全同意并接受本协议之约束，或者点击“我不同意”或“我不接受”表示用户不同意本协议。
					6.3.除了本协议第6.2条所述的方式之外，用户还可以通过浏览公益平台网站上来查阅、了解本协议。
					6.4.美团公益将会不定期地对本协议进行补充、修订。补充、修订后的协议将会在公益平台网站上对用户公布，该补充、修订一旦公布即成为本协议不可分割的组成部分，与之具有同等的法律效力。该等补充条款与本协议有矛盾或者冲突的地方，适用该补充、修改条款，没有涉及的内容，仍适用本协议的有关约定。
					6.5.公益平台服务内容或提供给用户的信息内容中如采用了除美团公益及其合作单位之外的第三方知识产权，而该等第三方对用户使用该知识产权有要求的，则第三方的要求将会以补充条款的形式向用户公布，用户亦应当一并遵守。
					6.6.本协议各条款是可分的，所约定的任何条款如果部分或者全部无效，不影响该条款其他部分及本协议其他条款的法律效力。
					6.7.本协议各条款的标题只是为了方便用户阅读而起到提示、醒目的作用，对本协议的解释及适用没有任何指引作用。
					6.8.用户若与美团公益或公益平台因本协议或其补充条款所涉及的有关事宜发生争议或者纠纷的，双方应当友好协商解决；协商不成的，用户完全同意将争议提交本协议签订地有管辖权的人民法院通过诉讼方式解决。
					6.9.本协议签订地为北京市朝阳区。本协议及其补充条款均受中华人民共和国法律、法规管辖。
					7.本协议于2018年6月22日生效。
					附件一：扣款授权确认书
					1.本确认书由参与公益商家计划的商家（以下简称“商家”）向商家入驻美团点评的合作主体（下称“美团点评”）以及北京钱袋宝支付技术有限公司（下称“钱袋宝”）出具，具有授权之法律效力。商家已审慎阅读、充分理解本确认书各条款内容，特别是免除或者限制责任的条款。商家通过勾选等方式接受本确认书所有条款，并同意使用自动扣款服务，自愿承担由此导致的一切法律后果。
					2.商家确认并不可撤销的授权美团点评向钱袋宝发出扣款指令，钱袋宝即可在不验证商家的账户密码、短信动态码等信息的情况下直接从商家钱袋宝中扣划相应款项至美团点评指定慈善组织的钱袋宝余额账户中；或由其他方式支付至慈善机构账户。
					3.在任何情况下，只要美团点评向钱袋宝发出支付指令，您确认并不可撤销的授权钱袋宝就可按照该指令从钱袋宝中进行资金扣划，钱袋宝对美团点评的支付指令的正确性、合法性、完整性、真实性不承担任何法律责任，相关法律责任由商家和美团点评或/及其关联方自行承担。
					3.商家保证在钱袋宝内预留有足够的资金余额，否则因金额不足导致无法及时扣款或扣款错误、失败的，一切责任由商家自行承担。因不可归责于钱袋宝的事由，导致的不能及时划付款项、划账错误等责任与钱袋宝无关。
					商家声明：
					1.本授权书是商家向钱袋宝、美团点评或/及其关联方做出的单方承诺，效力具有独立性，不因商家与美团点评或/及其关联方签署的各项服务合同的任何条款无效而失效。
					2.以上授权期限为商家作出本授权承诺之日生效至商家不再使用钱袋宝支付服务或本自动扣款服务为止。
					3.若商家与钱袋宝发生任何纠纷或争议，首先应友好协商解决；协商不成的，商家同意将纠纷或争议提交钱袋宝所在地有管辖权的人民法院管辖。本授权书的成立、生效、履行、解释及纠纷解决，适用中国人民共和国大陆地区法律（不包括冲突法）。
					4.商家已知悉本授权书所有内容（特别是加粗字体内容）的意义以及由此产生的法律效力，自愿作出上述授权，本授权书是商家真实的意思表示，商家同意承担由此带来的一切法律后果。
					特此授权！
					附件二：钱袋宝支付服务协议
					本着平等、互利、友好协商的原则，就用户使用北京钱袋宝支付技术有限公司（以下简称“钱袋宝”）网络支付服务等相关事宜达成一致，签订本协议，以资共同遵守。
					一、定义
					1.支付平台：指钱袋宝自行建设的以进行支付交易为主要目的的业务系统，以用户通过支付接口发来的付款指令为依据，为用户业务提供交易认证和款项收付等支付服务的系统。
					2.支付服务：是指钱袋宝通过支付平台向用户提供的支付软件系统、支付服务及其他相关服务。用户委托钱袋宝进行款项收付与资金结算服务。
					3.支付账户：指用户通过钱袋宝身份验证并同意本协议后取得的用户使用钱袋宝服务的支付账户。除本协议另有约定外，钱袋宝账户持有人可以使用与支付相关的服务。
					4.冻结，指用户钱袋宝账户存在风险或其他特殊状况时，钱袋宝根据用户的要求进行的冻结；或钱袋宝根据生效法律文书，协助有权国家机关进行的冻结。
					二、合作内容
					1.开户，开立钱袋宝支付账户，用户可根据实际需求，在钱袋宝开立一个或多个支付账户。
					2.充值，用户可以将用户银行卡内的资金充值到用户的钱袋宝账户。
					3.提现，用户可以将用户钱袋宝账户内余额划转至用户名下的可接收款项的中国大陆银行账户。
					4.在线查询服务：钱袋宝为用户设立支付平台查询功能，为用户提供信息管理和交易信息查询服务。
					5.其他支付产品：如用户需要其他的支付产品的需求，以双方签署产品协议或用户在钱袋宝系统中选择开通相应的产品为准。
					三、用户权利和义务
					1.用户应如实向钱袋宝提供资质资料，包括但不限于营业执照、开户许可证、法定代表人身份证复印件、ICP经营许可证或备案记录（如有）、公司业务介绍及基本业务情况说明、企业邮箱（非个人E-mail信箱）等。用户保证上述资料合法、真实、准确、完整。
					2.用户不得把支付账户（如有）、钱袋宝提供的接口技术、安全协议及证书用于本协议范围以外的用途，也不得出租、转让给任何第三方使用。用户不得将其他商户的交易伪造成自己的交易与钱袋宝结算。如果用户违反前述规定出租、出借、出售、购买账户的，钱袋宝可在发生前述情况的5年内不向用户提供支付账户所有业务。
					3.用户不得存储包括用户银行卡的磁道信息或芯片信息、验证码、密码、银行卡有效期在内的任何敏感信息，不得泄露用户身份信息和账户信息等。
					4.用户应妥善保管用户商户号、密码等信息。因用户未进行妥善保管造成用户资金损失的，钱袋宝不承担任何责任。若用户需对支付账户进行挂失，应及时与钱袋宝客服人员联系，并按相关要求进行操作。
					5.用户应妥善保管在钱袋宝开立支付账户预留的手机号，此手机号的用途为账户登录、接收支付账户短信通知、身份验证等。用户不得把手机号验证码信息提供给第三方操作认证，因用户未进行妥善保管造成用户资金损失的，钱袋宝不承担任何责任。若用户需对支付账户预留手机号进行变更，应至钱袋宝支付平台中进行操作，或与钱袋宝商服人员联系，并相关要求操作手机号变更。
					6.用户使用钱袋宝支付服务时，应确保自身发出指令的合法性、真实性、有效性和完整性。钱袋宝按用户发起的指令完成操作后，相关资金风险和责任由用户承担。
					7.用户应承诺发起的交易基于真实的交易背景，用户应保证其与用户客户之间交易的真实性、合法性，不得利用钱袋宝提供的服务进行虚假交易。用户应按钱袋宝的要求向钱袋宝提供详细的、真实可信的交易信息字段，交易信息至少包括：直接提供商品或服务的商户名称、商品订单号、商品名称、商品描述、交易金额、交易时间和地点、交易类型和渠道等。
					8.用户不得利用钱袋宝的支付服务从事任何非法行为，不得违反中国法律、法规、规章、规范性文件及政策，不得侵犯他人的合法权益，不得实施任何违反公序良俗和诚实信用的行为。如用户是中国大陆地区以外的特约商户，还需同时遵守其所属国家或地区的法律。
					9.用户不得对钱袋宝所有的包括不限于钱袋宝软件系统、程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、软件文档、运行在本地电脑内存中的数据、客户端至服务器端的数据、服务器数据等）进行复制、修改、编译、整合和篡改，不得修改或增加钱袋宝提供的钱袋宝软件系统的原有功能。
					10.用户核对汇总明细，对账单发现不符情况的，应及时向钱袋宝反馈。钱袋宝应设专门的岗位接受反馈，分析差错原因，并根据情况进行差错处理。
					11.用户应妥善保管交易产生的资料、数据，自交易完成之日起不少于五年。如因用户保管不善或其他违约行为造成的相关资金风险和责任由用户承担。如发生用户否认交易或拒付、监管机构的检查或法律法规要求提供的其他情形，用户应积极协助钱袋宝提供相关交易记录或凭证，自钱袋宝通知之日起7个工作日内提供。
					12.用户保证具有履行本协议的合法资格或资质，不得将钱袋宝提供的网络支付服务用于超出用户营业执照记载的经营范围的业务。用户为客户提供用户的客户服务电话，不得将钱袋宝的客户服务电话作为用户的客户服务电话发布在用户网站上误导消费者。
					13.用户发布的所有信息及从事的商业活动必须严格遵守国内现行法律法规、政府及工商管理部门的有关规定，并承担与此相应的责任。用户须独立承担因其网站信息虚假、陈旧、错误或不详实造成的投诉、退货、纠纷等责任。
					14.用户应按照钱袋宝提供的支付接口规范完成系统开发改造，实现与钱袋宝的系统对接，并完成相关的系统测试和系统投产准备工作，费用由用户自行承担。用户不得将钱袋宝向其收取的网络支付服务费用转嫁给用户。
					15.用户同意钱袋宝有权依据相关法律法规，按照监管部门/钱袋宝合作银行的要求，将其相关交易信息提供给监管部门/钱袋宝合作银行进行核查。
					16.用户使用本协议项下钱袋宝提供的相关服务时，应确保用户的订单处理、提供服务的程序与钱袋宝支付平台结算流程相匹配。
					17.未经钱袋宝书面授权，用户不得在多个域名或不同的网站上使用同一用户商户号的支付接口，不得把钱袋宝提供的接口技术、安全协议及证书等转交其它网站或第三方使用。
					18.用户如遇迁址、停业、域名或联系电话等商户资料信息变更，应提前通知钱袋宝，钱袋宝有权视具体情况暂停服务，若由于用户未及时通知而导致钱袋宝损失的，用户应承担责任。
					19.用户不得进行直接或变相套现、洗钱等违法违规行为，积极配合钱袋宝开展涉及公安等司法机构、人民银行反洗钱等监管机构的交易协查，有义务按要求提供相关交易信息，并且提供协助。
					20.用户不得采用技术手段或其它非法手段截获客户的相关信息并引导客户进行支付。用户不得采取任何方式，违规截取、留存或篡改用户客户或其他第三方使用钱袋宝支付业务服务的任何信息（包括但不限于用户信息、银行卡信息、充值卡信息等），不得在违背客户意愿的情况下代用户、客户或合作伙伴提交订单或发出虚假指令。否则，用户应独自承担由此引起的一切法律责任和后果。
					21.用户不得将本协议与本协议附件及各补充协议所约定服务用于除约定业务外的其它用途或通过任何方式转移给第三方。否则钱袋宝有权立即停止向用户提供相关服务，同时用户需赔偿由此给钱袋宝所造成的全部损失。
					22.用户应独立对使用本服务进行资金转移行为承担法律责任。用户应及时有效地处理其与用户、客户或合作伙伴等的之间发生的各种投诉、矛盾或纠纷。
					23.用户应承担用户平台发生的套现、欺诈、洗钱以及发卡机构合理拒付（包括但不限于持卡人否认交易）的交易风险及由此产生的损失和责任。因以上情形给钱袋宝造成损失的，用户需赔偿钱袋宝损失。用户如拖延、拒绝赔偿，钱袋宝有权直接从用户风险保证金或用户钱袋宝账户余额中进行赔偿。
					24.用户业务变更或终止应提前一个月书面通知钱袋宝，用户名称、地址、联系方式等用户相关信息变更应向钱袋宝提出书面或邮件申请，否则用户须承担由此造成的一切责任和后果。
					四、钱袋宝权利和义务
					1.钱袋宝负责钱袋宝支付平台的建设、运行和管理。钱袋宝支付平台的管理规则和功能钱袋宝可根据需要制定、修改上述管理规则和功能并进行公告。若用户不同意钱袋宝修改或制定的内容，应立即书面或邮件告知钱袋宝并同时停止使用钱袋宝提供的相关服务，双方办理解除本协议的相关手续；若用户继续使用钱袋宝提供的相关服务，则视为用户确认并承诺遵守钱袋宝制定或修改的管理规则和功能。
					2.钱袋宝对用户身份资料及支付信息负有保密义务，不得利用用户的上述信息从事超出法律许可或未经用户授权的活动。
					3.钱袋宝应为用户提供本协议约定的各项网络支付服务，并可按照约定向用户收取相关服务费用。
					4.钱袋宝应以明确的格式、内容、语言，对其提供的支付产品或服务依法向用户进行全面、充分的信息披露和风险提示。
					5.钱袋宝应确保用户交易资金的安全存放和准确及时划转。
					6.用户故意诋毁或非法损害钱袋宝声誉的，钱袋宝可立即终止提供支付服务，并追偿损失。
					7.钱袋宝可拒绝支付或追索用户违反国家法律法规或本协议约定的有关款项。
					8.钱袋宝应负责受理涉及钱袋宝支付平台、支付结算系统出现问题的投诉并解决相应的纠纷。用户理解并同意，钱袋宝作为支付机构，仅为用户提供本协议下的相关网络支付服务，用户与用户客户或其他任何第三方之间因网上交易可能发生的其他包括但不限于商品或服务质量、数量等纠纷，与钱袋宝无关。
					9.钱袋宝应设立业务咨询和联系电话，负责解答用户在使用钱袋宝支付平台中的遇到的各种疑问，并及时处理双方在数据对账、资金结算过程中的有关问题。
					10.钱袋宝应向用户提供履行本协议所需的相关接口技术、文档等资料并提供必要的指导。
					11.在用户未全面履行应尽义务且用户因业务或联络方式变更、终止而未及时通知钱袋宝致使钱袋宝十个工作日内联络用户未获回应的情况下，对于用户客户已支付但尚未结算给用户的订单款项，钱袋宝可根据用户客户提出的退款请求直接转回用户客户的账户。
					12.钱袋宝不得对用户经营的计算机系统和程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、软件文档、运行在本地电脑内存中的数据、客户端至服务器端的数据、服务器数据等）进行复制、修改、编译、整合和篡改。
					13.用户使用本服务，无论本协议是否有相反约定，即视为用户授权钱袋宝、钱袋宝关联方以及钱袋宝或钱袋宝关联方的合作方收集并合理使用用户在使用本服务过程中产生的所有相关信息和数据，包括但不限于用户的主体信息、账户信息（如财务数据、余额等）和交易信息等，钱袋宝有权将该信息和数据用于拓展业务、改善产品，从而更好地提供服务。但经过处理无法识别用户特定信息且不能复原的，钱袋宝无需用户授权。
					14.用户连续九十个自然日未使用钱袋宝服务产生交易额的，钱袋宝有权暂停、中止或终止本协议项下的服务而无需承担任何法律责任。如用户需继续使用，可向钱袋宝重新申请开通，经钱袋宝审核通过后方可。
					15.用户或用户客户/合作方在使用钱袋宝服务过程中非因钱袋宝原因被用户客户/合作方或其他有关方投诉的，钱袋宝有权要求用户和客户/合作方及时妥善解决或采取完善补救措施，用户或客户/合作方未能及时完善或补救的，钱袋宝有权视实际情况中止提供支付服务。钱袋宝投诉电话为支付平台中展示的电话号码。
					16.基于风险管理、运营管理或其他风险防控因素的考虑，钱袋宝有权提前十个工作日以书面形式告知用户暂停、中止或终止向用户提供本协议项下的服务无需承担任何法律责任。
					17.钱袋宝发布的所有信息及从事的商业活动必须严格遵守国内现行法律法规、政府及工商管理部门的有关规定，并承担与此相应的责任。钱袋宝须独立承担因其网站信息虚假、陈旧、错误或不详实造成的投诉与纠纷。
					18.钱袋宝仅向用户和用户客户/合作方提供电子支付中介服务，并不作为买方或卖方参与到用户与用户客户/合作方之间的交易，并不对该交易中用户提供的服务或产品的质量、安全及合法性和用户客户/合作方付款等承担任何个别或连带的担保、保证、赔偿责任或义务；用户客户/合作方向钱袋宝投诉用户并要求退款，钱袋宝联系用户30天后，在用户仍无回应的情况下，钱袋宝有权从用户未结算款中扣取相应金额返回给用户客户/合作方。
					19.钱袋宝保留对可疑交易、非法交易、高风险交易或交易纠纷开展调查、独立判断和确定的权利，并有权要求用户提供其交易相关的业务单据。
					20.当钱袋宝以向用户预留电子信箱发送电子邮件方式向用户确认有关业务时，发送成功既视为用户已收到，如需要用户回复的，用户应在收到电子邮件后一个工作日内确认并回复；如无需回复，用户在一个工作日内无其他意思表示的，视为用户知悉并认可电子邮件所表示内容。双方签订的一切协议、附件及补充协议等，均应以正式书面文件原件确认。
					五、支付账户开立
					钱袋宝可根据用户需要及《非银行支付机构网络支付业务管理办法》等法律法规的相关要求，为用户开立支付账户，并提供相关必要的信息查询、技术支持等服务，具体以钱袋宝实际提供的为准。主要流程包括：
					1.用户在钱袋宝支付平台如实填写、提供身份基本信息。
					2.本协议产品协议、附件为本协议组成部分。附件一《商户申请信息资料》作为用户在钱袋宝开立支付账户所需的信息依据，用户必须如实填写，并提供相应资质。若用户信息变更项符合附件二《商户信息变更申请表》所列信息时，用户按照附件二填写《商户信息变更申请表》并加盖公章后，钱袋宝按照变更申请进行操作。变更成功后，钱袋宝向用户发送变更成功通知。钱袋宝发送变更成功通知前用户其支付账户若造成用户损失的，钱袋宝不承担任何责任。用户若通过系统变更《商户申请信息资料》信息的，用户应保证变更操作是用户真实意思的表示，并对变更后信息产生的后果承担全部责任。
					3.钱袋宝按照实名制管理要求，登记并采取有效措施验证用户身份信息，按照规定核对有效身份证件并留存有效身份证件复印件或者影印件，建立用户唯一识别编码，确保有效核实用户身份及其真实意愿后，为其开立支付账户。如用户为从事电子商务经营活动、不具备工商登记注册条件且相关法律法规允许不进行工商登记注册的个人客户，并且不符合《非银行支付机构网络支付业务管理办法》关于支付机构参照单位客户管理的个人卖家的条件要求，钱袋宝应依据身份核验方式的不同为用户开立相应余额付款功能的支付账户。
					六、手续费用及结算
					1.钱袋宝支付平台使用手续费：
					(1)用户使用钱袋宝服务，用户同意按照钱袋宝标准支付手续费(以下简称“手续费”)。费用及结算方式以产品协议约定为准。
					(2)钱袋宝可因国家行政管理部门、中国人民银行、合作机构相关政策调整等情况调整手续费费率或因用户选择使用钱袋宝其他支付产品而收取手续费。钱袋宝将对此进行通知，如用户在收费规则生效之前未予以答复的将视为用户接受该调整，钱袋宝将按照通知公布的收费时间执行新的收费标准。如果用户在上述期限内提交了书面异议，那么用户和钱袋宝应对调整后的费率进行友好磋商，如果双方无法就费率变更达成一致意见的，任一方可终止本协议。
					2.结算说明
					(1)用户的交易结算账号为用户申请本服务时提交的同名银行账号、或用户自行绑定的开户银行账户或用户通过附件二变更的开户银行账户（以钱袋宝系统届时保存的银行账户为准），若因用户或银行的原因导致交易款项无法按时结算至用户提交的银行账号的，钱袋宝不承担任何责任。
					(2)用户收取结算款的银行账户：以用户自行绑定的开户银行账户为准。如用户不能通过前述方式变更结算银行账户的，用户应通过附件二向钱袋宝提交申请。
					(3)因用户变更账号但未及时通知钱袋宝导致增加的额外成本或任何损失，由用户承担。
					(4)交易款划付至用户在钱袋宝开立的账户周期以用户选择的产品为准。钱袋宝有权根据经营需要或用户/商户的经营状况、业务变化及实际赔付情况调整结算周期及结算转账起点，并以电子邮件通知的方式通知用户。
					(5)钱袋宝与用户对账数据不一致的，以钱袋宝数据为准。
					(6)若用户要求钱袋宝开具发票，应在首次开票前按照钱袋宝要求及时提交准确、完整的发票信息，当月的手续费发票在下月开出；如需增值税专用发票，用户应提交一般纳税人资质材料。
					七、退款条款
					如在交易中出现的因用户原因造成需做退款处理的情况，按如下规则处理：
					1.当用户向钱袋宝提出退款请求时，用户应保证自己账户中有足够退款的账存资金（被冻结款项除外），钱袋宝有权直接从用户账户中扣除退款金额完成退款，如因用户账户余额不足导致无法退款的，其后果由用户自行承担。钱袋宝按用户退款请求处理退款时，如因用户原因或用户原因导致退款失败的，钱袋宝将退款金额退用户账户，用户可再次发起退款请求或自行处理退款。
					2.退款时，钱袋宝不再另收取手续费，但若银行方面需要向钱袋宝另行收取相关费用的，则此费用应由用户自行承担，钱袋宝可从用户的交易款中扣除。
					3.发生退款情况，钱袋宝不再就该笔退款收取手续费，但钱袋宝也不再退还该笔交易已发生的手续费。
					八、交易限额
					依据双方合作业务类型以及风险不同而设定的交易限制额度：
					1.单笔最高限额：用户根据自身业务需要提出，并由钱袋宝或银行、银联等机构风险控制部门最终审核确定的单次扣款最高限制金额。
					2.单日最高限额：用户根据自身业务需要提出，并由钱袋宝或银行、银联等风险控制部门最终审核确定的用户单日扣款最高限制金额。
					3.为防范盗卡及拒付等风险，保护用户、钱袋宝、持卡人、银行的共同利益，钱袋宝将根据用户的交易情况（例如发生盗卡或拒付等风险交易所占的比例）、保证金的缴纳情况等对用户客户通过特定支付服务向用户付款的单笔额度和单日额度设定限额，并有权随时根据情况对限额作出调整。钱袋宝调整限额时，将提前通知用户。
					九、调单、先行赔付及风险处理
					1.若出现下列情形之一的，钱袋宝有权调单，即要求用户提供其交易的有效单据，包括但不限于发收货证明、发票等，用户应予配合。
					(1)银行、有权机关、钱袋宝发现用户交易出现异常状况或存在可疑风险交易的；
					(2)用户客户投诉、拒付、要求赔偿的。
					2.若钱袋宝、银行或有权机关发现用户某个时间段交易出现异常状况或存在可疑风险交易，钱袋宝有权立即暂缓相关交易款项的结算工作，并以电子邮件、传真或其他形式通知用户对该笔交易进行风险调单，用户需按要求提供真实有效的相关交易证据，待钱袋宝、银行或有权机关核准后由钱袋宝为其结算。
					3.用户若发生某笔交易被调单情形，则用户钱袋宝账户中的该笔/相应资金将由钱袋宝先行暂缓支付。经银行审查用户提交的资料后，认为用户应当赔付的，用户应当无条件全额对持卡人或银行或钱袋宝进行赔付，经审查后认为不需要赔付的，钱袋宝及时对用户钱袋宝账户中的该笔/相应资金进行解冻以及结算工作。
					4.若钱袋宝收到银行或有权机构方面的赔付通知，钱袋宝有权自收到赔付通知后即刻从用户的钱袋宝账户中等额扣除赔付款项，按照银行或有权机构要求进行偿还。若用户钱袋宝账户的余额不足，钱袋宝有权以用户预先支付的保证金作进行抵扣。在抵扣保证金仍不足以清偿赔付款的情况下，钱袋宝保留继续追偿的权利；在用户未能偿还赔付款项或保证金未补足时，钱袋宝有权暂时中止向用户提供相应服务，直至用户全部偿还赔付款项并补齐保证金为止。
					5.钱袋宝从用户钱袋宝账户中扣除赔付款项或保证金，应将银行的赔付通知等相关材料以本协议附表一所列明用户的Email或传真等方式及时通知用户。
					6.用户在收到钱袋宝的扣款通知后，对赔付有异议的，可直接与用户及银行联系，钱袋宝不处理关于赔付异议的任何纠纷。
					7.钱袋宝收到银行的相应赔付通知后，有权根据用户的风险评估状况，决定是否中止或终止向用户提供相应服务。
					8.针对用户将钱袋宝所提供的服务应用于本协议约定业务范围之外而产生的交易导致持卡用户拒付，用户均应当无条件全额对持卡人或银行或钱袋宝进行赔付。
					9.若用户的月风险交易笔数超过3笔或月风险交易金额超过1万元，则钱袋宝有权单方终止本协议。
					十、知识产权
					1.用户拥有其网站平台及相关系统、程序、产品和服务的一切权利，包括但不限于：文字、软件、声音、图片、录像、图表、广告中的全部内容、电子邮件的全部内容、用户网站为用户提供的其他信息等，所有上述内容均受法律的保护。
					2.钱袋宝拥有钱袋宝支付平台及相关系统、程序、产品和服务的一切权利，包括但不限于：文字、软件、声音、图片、录像、图表、广告中的全部内容、钱袋宝电子邮件的全部内容、钱袋宝网站为用户提供的其他信息等，所有上述内容均受法律的保护。
					3.用户因履行本协议需要使用以上权利的，应经钱袋宝书面许可。钱袋宝的书面许可不构成任何形式的权利转让。
					4.本协议终止后，前两款约定仍然有效。
					十一、保密义务
					1.除本协议另有约定外，未经一方书面同意，另一方不得将本协议内容、客户个人信息、客户支付信息以及一方提供给另一方的接口技术、安全协议及证书等透露给第三方。
					2.双方对在履行协议中获得的对方商业机密和技术秘密均负有保密责任。
					3.双方保证其雇员及代理人履行本条的保密义务。
					4.本合同任何一方均应对所获得的另一方的保密资料实施必要的安全保护措施，保护措施应当至少涵盖以下要求：
					(1)对于保密资料的访问应当充分做好访问控制（包括技术层面、物理层面），仅限于授权的相关人员或者相关应用进行访问。
					(2)禁止在第三方信息平台（如网盘、网站、博客等提供信息存储的平台）公开存储或处理对方的保密资料。
					(3)应当确保用于存储保密资料的技术平台安全性（包括网站、应用系统、操作系统、服务器、数据库等）。
					(4)应当对指定保密信息（如用户信息等）的传输和存储实施满足国家及监管要求的加密安全措施。
					5.本合同任何一方如发现对方存在涉及保密资料保护措施缺失、数据滥用、严重泄露等问题，发现方有权按照本协议相关条款进行处理，并且对于已产生的实际损失和不良影响，由对方全责承担。
					6.如钱袋宝预计超出本协议约定的范围使用用户信息的，钱袋宝将重新得到用户的授权。
					7.上述保密义务在本协议终止后仍然有效。
					十二、不可抗力及免责事由
					1.因受不可抗力影响而不能履行或不能完全履行本协议的一方可以部分或全部免除履行其责任。
					不可抗力是指不能预见、对其发生和后果不能避免且不能克服的事件。鉴于网络所具有之特殊性质，发生包括但不限于下列任何影响网络正常经营之情形导致钱袋宝不能履行本协议下义务的，钱袋宝可以免责：
					(1)大规模黑客攻击、计算机病毒侵入或发作；
					(2)非钱袋宝过错造成的计算机系统遭到破坏、瘫痪或无法正常使用的；
					(3)电信部门技术调整导致之重大影响；
					(4)因政府管制而造成的暂时性关闭等；
					(5)其它非钱袋宝过错造成的原因等。
					2.遇有上述不可抗力事件的一方，应立即将事件情况书面或电子邮件通知对方，并应于十五个工作日内通告事件详情，并提供相关证明材料以说明不能履行或不能完全履行、或需要延期履行的理由。双方按照事件对协议的履行的影响程度，再行决定是否继续履行本协议或终止协议。
					十三、风险提示及特别约定
					1.双方对于“中国国内电子商务环境尚未成熟，电子商务立法以及信用体制还不完善”的现状以及开展电子商务业务存在的风险性均完全知悉，双方均承诺采取相关风险防范措施，以尽量避免或减小风险。
					2.在网上支付交易中，遇到网上交易不真实、欺诈、冒用、持卡人拒付（Chargeback）由相关责任人自行解决，钱袋宝应提供必要配合，若由于用户错误造成的风险，由用户自行解决并担责。
					3.用户在使用钱袋宝进行支付交易过程中，遵守中国人民银行网上银行业务和信用卡相关交易相关的政策法规，不得进行虚假交易、资金非法套现、洗钱等非法行为。
					4.钱袋宝提示您注意，钱袋宝账户所记录的资金余额不同于用户的银行存款，不受《存款保险条例》保护，其实质为用户委托钱袋宝保管的、所有权归属于用户的预付价值。该预付价值对应的货币资金虽然属于用户，但不以用户名义存放在银行，而是以钱袋宝名义存放在银行，并且由钱袋宝向银行发起资金调拨指令。
					十四、反洗钱
					1.双方应按照《中华人民共和国反洗钱法》和《金融机构客户身份识别和客户身份资料及交易记录保存管理办法》、《支付机构反洗钱和反恐怖融资管理办法》等有关反洗钱的法律法规和双方协议约定履行反洗钱义务，并互相为对方在开展反洗钱工作上提供充分的协助。
					2.用户应保证资金来源合法，并保证使用钱袋宝提供的支付服务进行的交易真实合法。
					十五、违约责任
					1.双方中的任何一方违反在本协议中的义务、所做保证、承诺或其他约定，均构成违约，应承担由此产生的全部责任。
					2.用户违反本协议约定时，钱袋宝有权暂时停止为用户提供服务或采取其他保全措施。用户纠正其违约行为并承担相应违约责任后，钱袋宝应及时为用户恢复开通服务、解除相关保全措施。用户拒不承担违约责任的，用户同意钱袋宝有权从交易款中直接扣减相应金额用于赔偿钱袋宝损失。
					3.钱袋宝对用户在本协议项下的任何违约或延误行为施以宽容、宽限或延缓执行其享有的权利，均不能损害、影响或限制钱袋宝依本协议和有关法律规定应享有的一切权益、权利，不能视为钱袋宝放弃对现有或将来违约行为采取行动的权利。
					4.用户应向钱袋宝承担赔偿责任的，用户须在收到钱袋宝通知后五个工作日内向钱袋宝赔偿由于用户违约导致的钱袋宝所有损失，否则钱袋宝有权直接自用户名下的支付账户中扣取，若用户名下的支付账户余额不足时，用户应在五日内（含五日）向其钱袋宝支付账户充值并授权钱袋宝直接自账户余额中扣取直至赔付完毕；如用户在五日后仍未能足额向钱袋宝清偿的，钱袋宝有权终止双方签署的所有协议。
					十六、协议解除
					1.一方发生下列情形之一的，另一方可以立即解除本协议：
					(1)用户或钱袋宝未履行相关义务导致本协议不能实际履行；
					(2)一方被吊销营业执照，或因任何原因进入破产清算、和解或重整程序。
					2.发生下列情形之一的，钱袋宝可以暂停服务或解除本协议，并要求用户承担法律责任：
					(1)用户将钱袋宝的客户服务电话作为用户的客户服务电话发布在用户网站上的；
					(2)用户未经钱袋宝书面同意，擅自将钱袋宝提供的接口技术、安全协议及证书等转交其它网站或第三方使用的；
					(3)用户未按本协议向钱袋宝支付相关费用；
					(4)用户违反本协议中所做的承诺与保证的；
					(5)用户利用钱袋宝提供的服务从事非法活动的；
					(6)用户有其他违反本协议约定的行为，且在收到钱袋宝通知后两个工作日内，用户仍未采取措施纠正的。
					十七、争议解决和法律适用
					双方应以友好协商方式解决本协议履行过程中产生的争议，经协商无法解决争议时，提请协议被告住所地人民法院诉讼解决。本协议适用中华人民共和国法律。
					十八、其他条款
					1.本协议自双方签字、盖章之日起生效；钱袋宝向用户提供服务之日早于协议生效日的，自钱袋宝向用户提供服务之日起生效，有效期为一年。如本协议首次和后续历次有效期届满前的一个月内双方均未提出书面要求终止协议的，本协议应视为自动延期一年，以此类推。本协议一式贰份，双方各执壹份，具有同等法律效力。
					2.除非各方另有约定，本协议项下的所有通知应通过快递服务或电子邮箱传送。各方之间的通知及往来信函应发送至本协议载明的地址或电子邮箱(或收件人提前七个自然日向其他方发出书面通知说明的其他地址或电子邮箱) 。
					3.钱袋宝为用户提供支付服务，并可能根据实际情况签署单独的产品协议或其他协议（“产品协议”）或钱袋宝系统中选择开通相应的产品，遵守产品协议的有关约定。产品协议、收费规则等通知均为本协议的有效部分，与本协议具有同等效力。本协议与产品协议有冲突的，以产品协议为准。
					4.身份验证：为了向用户提供更好的服务，钱袋宝将及时有效验证用户及用户委托签约人的个人信息。根据法律法规及监管规定或钱袋宝认为有需要时，用户同意并授权钱袋宝可以把用户及用户委托签约人的个人的信息提供给第三方，也同意第三方可以把用户的信息提供给钱袋宝，以便钱袋宝进行验证。用户应确保钱袋宝登录名、账号或支付账户绑定的电子邮箱或手机号均为用户持有或得到用户授权。
					用户声明： 钱袋宝已提请我方注意对本协议各条款，特别是黑体字条款作全面、准确的理解，并应我方要求作了相应条款的说明。签约各方对本协议的含义认识一致，认同并接受本协议全部条款。
					本单位充分了解并清楚知晓出租、出借、出售、购买账户的相关法律责任和惩戒措施，承诺依法依规开立和使用本单位账。</div>
				<input type="checkbox" v-model="check">我已经阅读并同意
				<div class="mybtn"><button class="btn1" @click="cancel">取消</button>
					<button :class="check?'other':'btn'" :disabled="check?disabled:!disabled" @click="next">下一步</button></div>
			</div>
			<!-- <component :is="mycom"></component> -->
			<div class="box2" v-if="stepvalue==2">
				<p>企业做公益活动，首先是提高自身知名度，这和发广告是差不多的，都在宣传自己，让自己的品牌更多人知晓。
					其次，也是一种社会责任，企业依靠社会发展起来，那么也要反过来帮助社会发展。微公益顾名思义就是从微不足道的公益事情着手、 强调积少成多。
					虽然你没有亿万的身价、也没有强大的社会影响力，但是这并不妨碍你从事公益事业，用自己的行动去帮助需要帮助的人
					社会公益，一般是指不把利润最大化当作首要目标，且以社会公益事业为主要追求目标的公益活动</p>

				<button class="goon" @click="goon">下一步</button>
			</div>
			<div class="box3" v-if="stepvalue==3">
				<div class="minbox3">机构名称:<input type="text" v-model="obj.companyname"><br>
					图片地址:<input type="text" v-model="obj.imgurl"><br>
					<button class="mysubm" @click="Submit">注册提交</button>
					</div>

			</div>
		</div>



	</div>
</template>

<script>
	// import Steptwo from "@/views/Steptwo.vue"
	export default {
		name: "join",
		data() {
			return {
				num: 1,
				stepvalue: 1,
				check: false,
				obj: {
					companyname: "",
					imgurl: ""

				},
				disabled: false



			}
		},
		components: {
			"Head": () => import("@/components/Head.vue"),
		},

		methods: {
			cancel() {
				this.$router.push({
					name: "Home"
				})

			},
			next() {
				this.num = 2
				this.stepvalue = 2


			},
			goon() {
				this.num = 3
				this.stepvalue = 3
			},
			Submit() {
				if (!this.obj.companyname) {
					alert("请输入机构名字")
				} else {
					var url = "http://localhost:7001/register"
					this.$axios.post(url, this.obj, ).then((res) => {
						if (res.data.code == 0) {
							alert("该机构已入驻")

						} else if (res.data.code == 1) {
							alert("机构入驻成功")
						}
					})
				}

			}

		}
	}
</script>

<style>
	.minbox3{
		margin-left: 350px;
		margin-top: 30px;
		
	}
	.goon {
		width: 10%;
		height: 30px;
		background-color: #f55724;
		border: none;
		margin-left: 50%;
		margin-top: 100px;
	}

	.mysubm {
		height: 25px;
		background-color: #f55724;
		border: none;
	

	}

	.box1 {
		width: 90%;
		height: 90%;
		/* background-color: coral; */
		margin: 0 auto;
		/* display: none; */


	}

	.box2 {
		width: 90%;
		height: 800px;

		background-color: #f4f4f4;
		margin: 0 auto;
	}

	.box3 {
		
		
		width: 90%;
		height: 1000px;
		margin: 0 auto;

	}

	input {
		border-radius: initial;
	}

	.btn1 {
		border: 1px solid #f9f9f9;
	}

	.btn {
		border: none;
		background-color: #f9f9f9;

	}

	.other {
		border: none;
		background-color: #f55724;
	}

	.read {
		width: 80%;
		height: 500px;
		background-color: #f4f4f4;
		margin: 0 auto;
		overflow-y: auto;
		font-size: 14px
	}

	.mybtn {}
</style>
